tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/cabin/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0 260)
            (10 293)
            (1000 293)
        );
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 260;
        value           uniform 260;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            zeroGradient;
    }

    cabin_to_ice
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 260;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;

        // windshield 3 mm
        thicknessLayers (0.003);
        kappaLayers     (0.9);
    }
}


// ************************************************************************* //
